Taxi/test_billing_fin_payouts/cron/static/test_upload_to_yt/accruals_expected.json

{
  "expected_created_yt_tables": [
    {
      "path": "//testsuite/unittests/features/billing-fin-payouts/accruals/2022-05",
      "schema": [
        {
          "demand": "required",
          "name": "export_id",
          "sort_order": "ascending",
          "type": "int64"
        },
        {
          "name": "export_created_at_utc",
          "type": "string"
        },
        {
          "name": "idempotency_key",
          "type": "string"
        },
        {
          "name": "client_id",
          "type": "string"
        },
        {
          "name": "billing_contract_id",
          "type": "string"
        },
        {
          "name": "transaction_type",
          "type": "string"
        },
        {
          "name": "transaction_dt",
          "type": "string"
        },
        {
          "name": "service_id",
          "type": "int32"
        },
        {
          "name": "paysys_type_cc",
          "type": "string"
        },
        {
          "name": "terminalid",
          "type": "string"
        },
        {
          "name": "bill_num",
          "type": "string"
        },
        {
          "name": "partner_currency",
          "type": "string"
        },
        {
          "name": "amount",
          "type": "string"
        },
        {
          "name": "yandex_reward",
          "type": "string"
        },
        {
          "name": "reference_currency",
          "type": "string"
        },
        {
          "name": "reference_amount",
          "type": "string"
        },
        {
          "name": "event",
          "type": "any"
        },
        {
          "name": "payload",
          "type": "any"
        },
        {
          "name": "dry_run",
          "type": "boolean"
        }
      ]
    }
  ],
  "expected_get_calls": [],
  "expected_lock_calls": [
    {
      "//testsuite/unittests/features/billing-fin-payouts": "@accruals_cursor"
    }
  ],
  "expected_set_calls": [
    {
      "//testsuite/unittests/features/billing-fin-payouts/@accruals_cursor": 5
    }
  ],
  "expected_uploaded_data": {
    "//testsuite/unittests/features/billing-fin-payouts/accruals/2022-05": [
      {
        "amount": "102.00",
        "bill_num": null,
        "billing_contract_id": "676914",
        "client_id": "56579731",
        "dry_run": false,
        "event": null,
        "export_created_at_utc": "2022-05-30T00:00:00.000000+00:00",
        "export_id": 1,
        "idempotency_key": "INTERFACE_PAYMENTS/14341732235",
        "partner_currency": "RUB",
        "payload": null,
        "paysys_type_cc": "yandex",
        "reference_amount": "102.00",
        "reference_currency": "RUB",
        "service_id": 124,
        "terminalid": null,
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "PAYMENT",
        "yandex_reward": "0.00"
      },
      {
        "amount": "10.00",
        "bill_num": null,
        "billing_contract_id": "808972",
        "client_id": "61092938",
        "dry_run": false,
        "event": null,
        "export_created_at_utc": "2022-05-30T00:00:00.000000+00:00",
        "export_id": 2,
        "idempotency_key": "INTERFACE_PAYMENTS/14341732236",
        "partner_currency": "BYN",
        "payload": null,
        "paysys_type_cc": "terminalid",
        "reference_amount": "10.00",
        "reference_currency": "BYN",
        "service_id": 125,
        "terminalid": "55411503",
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "REFUND",
        "yandex_reward": "0.00"
      },
      {
        "amount": "128.00",
        "bill_num": null,
        "billing_contract_id": "3830002",
        "client_id": "94636168",
        "dry_run": false,
        "event": null,
        "export_created_at_utc": "2022-05-30T00:00:00.000000+00:00",
        "export_id": 3,
        "idempotency_key": "INTERFACE_PAYMENTS/14341732241",
        "partner_currency": "RUB",
        "payload": null,
        "paysys_type_cc": "psb_logist",
        "reference_amount": "128.00",
        "reference_currency": "RUB",
        "service_id": 124,
        "terminalid": null,
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "PAYMENT",
        "yandex_reward": "0.00"
      },
      {
        "amount": "252.00",
        "bill_num": null,
        "billing_contract_id": "317971",
        "client_id": "37904064",
        "dry_run": false,
        "event": null,
        "export_created_at_utc": "2022-05-30T00:00:00.000000+00:00",
        "export_id": 4,
        "idempotency_key": "INTERFACE_PAYMENTS/14341732245",
        "partner_currency": "RUB",
        "payload": null,
        "paysys_type_cc": "terminalid",
        "reference_amount": "252.00",
        "reference_currency": "RUB",
        "service_id": 124,
        "terminalid": "57000589",
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "PAYMENT",
        "yandex_reward": "0.00"
      },
      {
        "amount": "864.52",
        "bill_num": null,
        "billing_contract_id": "3050589",
        "client_id": "92907586",
        "dry_run": false,
        "event": null,
        "export_created_at_utc": "2022-05-30T00:00:00.000000+00:00",
        "export_id": 5,
        "idempotency_key": "INTERFACE_PAYMENTS/14341732247",
        "partner_currency": "RUB",
        "payload": null,
        "paysys_type_cc": "terminalid",
        "reference_amount": "864.52",
        "reference_currency": "RUB",
        "service_id": 124,
        "terminalid": "57000417",
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "PAYMENT",
        "yandex_reward": "0.48"
      }
    ]
  }
}
