Taxi/test_billing_fin_payouts/cron/static/test_upload_to_yt/export_batches_expected.json

{
  "expected_created_yt_tables": [
    {
      "path": "//testsuite/unittests/features/billing-fin-payouts/export_batches/2022-03",
      "schema": [
        {
          "demand": "required",
          "name": "export_id",
          "sort_order": "ascending",
          "type": "int64"
        },
        {
          "name": "batch_id",
          "type": "int64"
        },
        {
          "name": "client_id",
          "type": "string"
        },
        {
          "name": "firm_id",
          "type": "int32"
        },
        {
          "name": "contract_id",
          "type": "string"
        },
        {
          "name": "person_id",
          "type": "string"
        },
        {
          "name": "contract_alias",
          "type": "string"
        },
        {
          "name": "currency",
          "type": "string"
        },
        {
          "name": "amount_w_vat",
          "type": "string"
        },
        {
          "name": "contract_type",
          "type": "string"
        },
        {
          "name": "export_created_at_utc",
          "type": "string"
        },
        {
          "name": "type_code",
          "type": "string"
        },
        {
          "name": "status_code",
          "type": "string"
        },
        {
          "name": "dry_run",
          "type": "boolean"
        },
        {
          "name": "oebs_payment_batch_id",
          "type": "int32"
        },
        {
          "name": "oebs_payment_id",
          "type": "int32"
        },
        {
          "name": "oebs_payment_date",
          "type": "string"
        },
        {
          "name": "payload",
          "type": "any"
        },
        {
          "name": "created_at_utc",
          "type": "string"
        },
        {
          "name": "updated_at_utc",
          "type": "string"
        }
      ]
    },
    {
      "path": "//testsuite/unittests/features/billing-fin-payouts/dry_export_batches/2022-03",
      "schema": [
        {
          "demand": "required",
          "name": "export_id",
          "sort_order": "ascending",
          "type": "int64"
        },
        {
          "name": "batch_id",
          "type": "int64"
        },
        {
          "name": "client_id",
          "type": "string"
        },
        {
          "name": "firm_id",
          "type": "int32"
        },
        {
          "name": "contract_id",
          "type": "string"
        },
        {
          "name": "person_id",
          "type": "string"
        },
        {
          "name": "contract_alias",
          "type": "string"
        },
        {
          "name": "currency",
          "type": "string"
        },
        {
          "name": "amount_w_vat",
          "type": "string"
        },
        {
          "name": "contract_type",
          "type": "string"
        },
        {
          "name": "export_created_at_utc",
          "type": "string"
        },
        {
          "name": "type_code",
          "type": "string"
        },
        {
          "name": "status_code",
          "type": "string"
        },
        {
          "name": "dry_run",
          "type": "boolean"
        },
        {
          "name": "oebs_payment_batch_id",
          "type": "int32"
        },
        {
          "name": "oebs_payment_id",
          "type": "int32"
        },
        {
          "name": "oebs_payment_date",
          "type": "string"
        },
        {
          "name": "payload",
          "type": "any"
        },
        {
          "name": "created_at_utc",
          "type": "string"
        },
        {
          "name": "updated_at_utc",
          "type": "string"
        }
      ]
    }
  ],
  "expected_get_calls": [],
  "expected_lock_calls": [
    {
      "//testsuite/unittests/features/billing-fin-payouts": "@export_batches_cursor"
    }
  ],
  "expected_set_calls": [
    {
      "//testsuite/unittests/features/billing-fin-payouts/@export_batches_cursor": 7
    }
  ],
  "expected_uploaded_data": {
    "//testsuite/unittests/features/billing-fin-payouts/dry_export_batches/2022-03": [
      {
        "amount_w_vat": "1234.58",
        "batch_id": 4,
        "client_id": "123458",
        "contract_alias": "854321/123",
        "contract_id": "854321",
        "contract_type": "revenues",
        "created_at_utc": "2022-03-21T04:59:29.085602+00:00",
        "currency": "RUB",
        "dry_run": true,
        "export_created_at_utc": "2022-03-04T09:53:52.200001+00:00",
        "export_id": 5,
        "firm_id": 13,
        "oebs_payment_batch_id": null,
        "oebs_payment_date": null,
        "oebs_payment_id": null,
        "payload": null,
        "person_id": "444444",
        "status_code": "EXPORT_READY",
        "type_code": "PAYOUT_ZERO",
        "updated_at_utc": "2022-03-21T04:59:29.085602+00:00"
      }
    ],
    "//testsuite/unittests/features/billing-fin-payouts/export_batches/2022-03": [
      {
        "amount_w_vat": "1234.56",
        "batch_id": 1,
        "client_id": "123456",
        "contract_alias": "654321/123",
        "contract_id": "654321",
        "contract_type": "revenues",
        "created_at_utc": "2022-03-21T04:59:29.085602+00:00",
        "currency": "RUB",
        "dry_run": false,
        "export_created_at_utc": "2022-03-03T09:53:52.200001+00:00",
        "export_id": 2,
        "firm_id": 13,
        "oebs_payment_batch_id": null,
        "oebs_payment_date": null,
        "oebs_payment_id": null,
        "payload": null,
        "person_id": "111111",
        "status_code": "EXPORT_READY",
        "type_code": "PAYOUT",
        "updated_at_utc": "2022-03-21T04:59:29.085602+00:00"
      },
      {
        "amount_w_vat": "1234.57",
        "batch_id": 2,
        "client_id": "123457",
        "contract_alias": "754321/123",
        "contract_id": "754321",
        "contract_type": "revenues",
        "created_at_utc": "2022-03-21T04:59:29.085602+00:00",
        "currency": "RUB",
        "dry_run": false,
        "export_created_at_utc": "2022-03-03T09:53:52.200001+00:00",
        "export_id": 4,
        "firm_id": 13,
        "oebs_payment_batch_id": null,
        "oebs_payment_date": null,
        "oebs_payment_id": null,
        "payload": null,
        "person_id": "222222",
        "status_code": "EXPORT_READY",
        "type_code": "PAYOUT",
        "updated_at_utc": "2022-03-21T04:59:29.085602+00:00"
      },
      {
        "amount_w_vat": "1234.58",
        "batch_id": 3,
        "client_id": "123458",
        "contract_alias": "854321/123",
        "contract_id": "854321",
        "contract_type": "revenues",
        "created_at_utc": "2022-03-21T04:59:29.085602+00:00",
        "currency": "RUB",
        "dry_run": false,
        "export_created_at_utc": "2022-03-04T09:53:52.200001+00:00",
        "export_id": 7,
        "firm_id": 13,
        "oebs_payment_batch_id": null,
        "oebs_payment_date": null,
        "oebs_payment_id": null,
        "payload": null,
        "person_id": "333333",
        "status_code": "EXPORT_READY",
        "type_code": "PAYOUT",
        "updated_at_utc": "2022-03-21T04:59:29.085602+00:00"
      }
    ]
  }
}
