Taxi/test_billing_fin_payouts/cron/static/test_upload_to_yt/payout_ready_batches_expected.json

{
  "expected_created_yt_tables": [
    {
      "path": "//testsuite/unittests/features/billing-fin-payouts/payout_ready_batches/2022-03",
      "schema": [
        {
          "demand": "required",
          "name": "export_id",
          "sort_order": "ascending",
          "type": "int64"
        },
        {
          "name": "batch_id",
          "type": "int64"
        },
        {
          "name": "client_id",
          "type": "string"
        },
        {
          "name": "firm_id",
          "type": "int32"
        },
        {
          "name": "contract_id",
          "type": "string"
        },
        {
          "name": "person_id",
          "type": "string"
        },
        {
          "name": "contract_alias",
          "type": "string"
        },
        {
          "name": "currency",
          "type": "string"
        },
        {
          "name": "amount_w_vat",
          "type": "string"
        },
        {
          "name": "contract_type",
          "type": "string"
        },
        {
          "name": "type_code",
          "type": "string"
        },
        {
          "name": "status_code",
          "type": "string"
        },
        {
          "name": "dry_run",
          "type": "boolean"
        },
        {
          "name": "export_created_at_utc",
          "type": "string"
        }
      ]
    },
    {
      "path": "//testsuite/unittests/features/billing-fin-payouts/dry_payout_ready_batches/2022-03",
      "schema": [
        {
          "demand": "required",
          "name": "export_id",
          "sort_order": "ascending",
          "type": "int64"
        },
        {
          "name": "batch_id",
          "type": "int64"
        },
        {
          "name": "client_id",
          "type": "string"
        },
        {
          "name": "firm_id",
          "type": "int32"
        },
        {
          "name": "contract_id",
          "type": "string"
        },
        {
          "name": "person_id",
          "type": "string"
        },
        {
          "name": "contract_alias",
          "type": "string"
        },
        {
          "name": "currency",
          "type": "string"
        },
        {
          "name": "amount_w_vat",
          "type": "string"
        },
        {
          "name": "contract_type",
          "type": "string"
        },
        {
          "name": "type_code",
          "type": "string"
        },
        {
          "name": "status_code",
          "type": "string"
        },
        {
          "name": "dry_run",
          "type": "boolean"
        },
        {
          "name": "export_created_at_utc",
          "type": "string"
        }
      ]
    },
    {
      "path": "//testsuite/unittests/features/billing-fin-payouts/dry_payout_ready_batches/2022-04",
      "schema": [
        {
          "demand": "required",
          "name": "export_id",
          "sort_order": "ascending",
          "type": "int64"
        },
        {
          "name": "batch_id",
          "type": "int64"
        },
        {
          "name": "client_id",
          "type": "string"
        },
        {
          "name": "firm_id",
          "type": "int32"
        },
        {
          "name": "contract_id",
          "type": "string"
        },
        {
          "name": "person_id",
          "type": "string"
        },
        {
          "name": "contract_alias",
          "type": "string"
        },
        {
          "name": "currency",
          "type": "string"
        },
        {
          "name": "amount_w_vat",
          "type": "string"
        },
        {
          "name": "contract_type",
          "type": "string"
        },
        {
          "name": "type_code",
          "type": "string"
        },
        {
          "name": "status_code",
          "type": "string"
        },
        {
          "name": "dry_run",
          "type": "boolean"
        },
        {
          "name": "export_created_at_utc",
          "type": "string"
        }
      ]
    }
  ],
  "expected_get_calls": [],
  "expected_lock_calls": [
    {
      "//testsuite/unittests/features/billing-fin-payouts": "@payout_ready_batches_cursor"
    }
  ],
  "expected_set_calls": [
    {
      "//testsuite/unittests/features/billing-fin-payouts/@payout_ready_batches_cursor": 9
    }
  ],
  "expected_uploaded_data": {
    "//testsuite/unittests/features/billing-fin-payouts/dry_payout_ready_batches/2022-03": [
      {
        "amount_w_vat": "1234.58",
        "batch_id": 4,
        "client_id": "123458",
        "contract_alias": "854321/123",
        "contract_id": "854321",
        "contract_type": "revenues",
        "currency": "RUB",
        "dry_run": true,
        "export_created_at_utc": "2022-03-03T09:53:52.200001+00:00",
        "export_id": 5,
        "firm_id": 13,
        "person_id": "444444",
        "status_code": "PAYOUT_READY",
        "type_code": "PAYOUT"
      }
    ],
    "//testsuite/unittests/features/billing-fin-payouts/dry_payout_ready_batches/2022-04": [
      {
        "amount_w_vat": "1234.58",
        "batch_id": 5,
        "client_id": "123458",
        "contract_alias": "854321/123",
        "contract_id": "854321",
        "contract_type": "revenues",
        "currency": "RUB",
        "dry_run": true,
        "export_created_at_utc": "2022-04-04T09:53:52.200001+00:00",
        "export_id": 9,
        "firm_id": 13,
        "person_id": "444444",
        "status_code": "PAYOUT_READY",
        "type_code": "PAYOUT"
      }
    ],
    "//testsuite/unittests/features/billing-fin-payouts/payout_ready_batches/2022-03": [
      {
        "amount_w_vat": "1234.56",
        "batch_id": 1,
        "client_id": "123456",
        "contract_alias": "654321/123",
        "contract_id": "654321",
        "contract_type": "revenues",
        "currency": "RUB",
        "dry_run": false,
        "export_created_at_utc": "2022-03-03T09:53:52.200001+00:00",
        "export_id": 2,
        "firm_id": 13,
        "person_id": "111111",
        "status_code": "PAYOUT_READY",
        "type_code": "PAYOUT"
      },
      {
        "amount_w_vat": "1234.57",
        "batch_id": 2,
        "client_id": "123457",
        "contract_alias": "754321/123",
        "contract_id": "754321",
        "contract_type": "revenues",
        "currency": "RUB",
        "dry_run": false,
        "export_created_at_utc": "2022-03-03T09:53:52.200001+00:00",
        "export_id": 4,
        "firm_id": 13,
        "person_id": "222222",
        "status_code": "PAYOUT_READY",
        "type_code": "PAYOUT"
      },
      {
        "amount_w_vat": "1234.58",
        "batch_id": 3,
        "client_id": "123458",
        "contract_alias": "854321/123",
        "contract_id": "854321",
        "contract_type": "revenues",
        "currency": "RUB",
        "dry_run": false,
        "export_created_at_utc": "2022-03-04T09:53:52.200001+00:00",
        "export_id": 7,
        "firm_id": 13,
        "person_id": "333333",
        "status_code": "PAYOUT_READY",
        "type_code": "PAYOUT"
      }
    ]
  }
}
